04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p5/0/TauDNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(4.045681747877512513e-07 3.566090803858982312e-09 0.000000000000000000e+00 2.649791369445474257e-10 0.000000000000000000e+00 1.352702378761820566e-07)
(4.034799861489514975e-07 3.680163482562928583e-09 0.000000000000000000e+00 2.702418718773537079e-10 0.000000000000000000e+00 1.377076123670719451e-07)
(4.018837391376560426e-07 3.786133082694857349e-09 0.000000000000000000e+00 2.759472510512352155e-10 0.000000000000000000e+00 1.400106616539054747e-07)
(4.001043713414648847e-07 3.894003053838412658e-09 0.000000000000000000e+00 2.836265598153552560e-10 0.000000000000000000e+00 1.422062559485714138e-07)
(3.980965496469033872e-07 3.985163334158319725e-09 0.000000000000000000e+00 2.910899545442430049e-10 0.000000000000000000e+00 1.443117808448258687e-07)
(3.959552926045529062e-07 4.078057649160942267e-09 0.000000000000000000e+00 2.977931146838541887e-10 0.000000000000000000e+00 1.462516567345669841e-07)
(3.933771010526245275e-07 4.155457476571840510e-09 0.000000000000000000e+00 3.041472486327927992e-10 0.000000000000000000e+00 1.479548114656524515e-07)
(3.909202790007925735e-07 4.222157698079529310e-09 0.000000000000000000e+00 3.112560367164498528e-10 0.000000000000000000e+00 1.495860386621788913e-07)
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            zeroGradient;
    }
}