04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p5/0/UDNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14751
(
(1.432913677962094519e-03 -4.928292950779778896e-07 6.066470673593001505e-07)
(1.452156319564867210e-03 -3.738027702201793474e-07 6.242684837992395570e-07)
(1.467410767582018067e-03 -2.974119647127154305e-07 6.579348998269459307e-07)
(1.478432319235082389e-03 -2.382844323522490506e-07 6.910143292935181171e-07)
(1.485036293181822911e-03 -1.038332725424067673e-07 7.177220446863818730e-07)
(1.487177134691153530e-03 2.130499892818863693e-08 7.531711897107081152e-07)
(1.484871388133316306e-03 7.890655860610738681e-08 8.155333003546276586e-07)
(1.478318355456810203e-03 1.654356072223849835e-07 8.932276637261709324e-07)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}